/* About screen blog label */
"About.blog" = "https://bitradio.io/";

/* About screen footer */
"About.footer" = "Imetengenezwa na kikundi kutoka kote duniani cha DigiWallet. Version %1$@";

/* Privay Policy button label */
"About.privacy" = "Sera ya Faragha";

/* About screen reddit label */
"About.reddit" = "https://www.reddit.com/r/bitradio/";

/* Terms of Use button label */
"About.terms" = "Sheria na Masharti";

/* About screen title */
"About.title" = "DigiWallet ya iOS ni kipochi rununu cha bitradio.";

/* About screen twitter label */
"About.twitter" = "https://twitter.com/bitradiocoin";

/* Close modal button accessibility label */
"AccessibilityLabels.close" = "Funga";

/* Support center accessibiliy label */
"AccessibilityLabels.faq" = "Kituo cha Usaidizi";

/* Loading Wallet Message */
"Account.loadingMessage" = "Kipochi Kupakia";

/* Default wallet name */
"AccountHeader.defaultWalletName" = "Kipochi Changu";

/* Error alert title */
"Alert.error" = "Hitilafu";

/* No internet alert message */
"Alert.noInternet" = "Mtandao wa internet haupatikani kwa sasa. Tafadhali angalia muunganisho wa mtandao wako, kisha ujaribu tena.  ";

/* Warning alert title */
"Alert.warning" = "Onyo";

/* 'the addresses were copied'' Alert title */
"Alerts.copiedAddressesHeader" = "Anwani Kunakiliwa";

/* Addresses Copied Alert sub header */
"Alerts.copiedAddressesSubheader" = "Anwani zote kunakiliwa vilivyo.";

/* Alert Header Label (the paper key was set) */
"Alerts.paperKeySet" = "Kifunguo Binafsi Kimewekwa";

/* Alert Subheader label (playfully positive) */
"Alerts.paperKeySetSubheader" = "Shwari!";

/* Alert Header label (the PIN was set) */
"Alerts.pinSet" = "Pini Imewekwa";

/* Send failure alert header label (the send failed to happen) */
"Alerts.sendFailure" = "Tatizo na kutuma";

/* Send success alert header label (confirmation that the send happened) */
"Alerts.sendSuccess" = "Tuma Thibitisho";

/* Send success alert subheader label (e.g. the money was sent) */
"Alerts.sendSuccessSubheader" = "bitradio Zimetumwa! ";

/* JSON Serialization error message */
"ApiClient.jsonError" = "Herufi sambamba za JSON zinakasoro";

/* Wallet not ready error message */
"ApiClient.notReady" = "Kipochi sio tayari";

/* API Token error message */
"ApiClient.tokenError" = "Kasoro na kupata ishara ya API";

/* header of balance */
"Balance.header" = "TOTAL\nBALANCE";

/* Send BCH view body. */
"BCH.body" = "Weka anwani ya kupokea bitradio hapo chini. bitradio zote zilizopatikana kwa kipochi chako wakati wa kuboresha mtandao (fork) (%1$@) zitatumwa.    ";

/* Confirm sending <$5.00> to <address>? */
"BCH.confirmationMessage" = "Thibitisha kamili kutuma %1$@ kwa %2$@";

/* Confirmation alert title */
"BCH.confirmationTitle" = "Thibitisho";

/* Generic bch erorr message */
"BCH.genericError" = "Akaunti yako haina bitradio zozote, ama umezipata baada ya mitambo kuboreshwa (fork).";

/* Transaction ID copied message */
"BCH.hashCopiedMessage" = "Maelezo kamili ya shughuli kunakiliwa";

/* No address error message */
"BCH.noAddressError" = "Ingiza anwani kamili";

/* Attempted to scan unsupported qr code error message. */
"BCH.paymentProtocolError" = "Mpangilio wa maombi za malipo haufanikishwi kupitia shughuli za bitradio ";

/* BCH successfully sent alert message */
"BCH.successMessage" = "bitradio zimetumwa bila hitilafu.";

/* Widthdraw BCH view title */
"BCH.title" = "Kutoa bitradio";

/* Tx Hash button header */
"BCH.txHashHeader" = "Maelezo kamili ya shughuli ya kutuma au kupokea bitradio";

/* Approve button label */
"BitID.approve" = "Idhinisha\n";

/* <sitename> is requesting authentication using your bitcoin wallet */
"BitID.authenticationRequest" = "%1$@ anaitisha uhalalishaji kupitia kipochi chako cha bitradio";

/* Deny button label */
"BitID.deny" = "Kanusha";

/* BitID error alert title */
"BitID.error" = "Hitilafu kwa uhalalishaji";

/* BitID error alert messaage (The payment service you are trying to use isn't working. Please contact them, as you may need to try again) */
"BitID.errorMessage" = "Tafadhali angalia huduma. Na ujaribu tena. ";

/* BitID success alert title */
"BitID.success" = "Imethibitishwa Vilivyo";

/* Cancel button label */
"Button.cancel" = "Kufuta";

/* Ignore button label */
"Button.ignore" = "Puuza";

/* menu button */
"Button.menu" = "orodha";

/* No button */
"Button.no" = "Hapana";

/* OK button label */
"Button.ok" = "Sawa";

/* receive button */
"Button.receive" = "Pokea";

/* send button */
"Button.send" = "tuma";

/* Settings button label */
"Button.settings" = "Mipangilio";

/* Settings button label */
"Button.submit" = "Tuma";

/* Yes button */
"Button.yes" = "Ndio";

/* Camera plugin instruction */
"CameraPlugin.centerInstruction" = "Weka ID yako katika sehemu ya kati ya sanduku ";

/* Amount to Send: ($1.00) */
"Confirmation.amountLabel" = "Kiasi Cha Kutuma";

/* Network Fee: ($1.00) */
"Confirmation.feeLabel" = "Ada ya Mtandao:";

/* eg. Processing time: This transaction will take 10-30 minutes to process. */
"Confirmation.processingTime" = "Muda wa usindikaji: Shughuli hii itatumia takriban sekunde %1$@ kukamilika";

/* Label for "send" button on final confirmation screen */
"Confirmation.send" = "Tuma";

/* Confirmation Screen title */
"Confirmation.title" = "Thibitisho";

/* To: (address) */
"Confirmation.to" = "Kwa";

/* Total Cost: ($5.00) */
"Confirmation.totalLabel" = "Gharama Kamili: ";

/* Confirm paper phrase view label. */
"ConfirmPaperPhrase.label" = "Ili kuhakikisha kila kitu kiliandikwa kwa usahihi, tafadhali ingiza maneno yafuatayo kutoka kwa Kifunguo chako binafsi cha kuokoa kipochi.";

/* Word label eg. Word #1, Word #2 */
"ConfirmPaperPhrase.word" = "Neno #%1$@";

/* Bitcoin denomination picker label */
"DefaultCurrency.bitcoinLabel" = "Kitengo cha bitradio cha maonesho ";

/* Exchange rate label */
"DefaultCurrency.rateLabel" = "Kima cha Kubadilisha";

/* Email unavailable alert title */
"ErrorMessages.emailUnavailableMessage" = "Kifaa hichi hakiwezi kutumiwa kutuma barua pepe na app ya kutuma barua pepe ya iOS";

/* Email unavailable alert title */
"ErrorMessages.emailUnavailableTitle" = "Barua pepe haipatikani";

/* Messaging unavailable alert title */
"ErrorMessages.messagingUnavailableMessage" = "Kifaa hichi hakijatengenezwa vilivyo kutuma ujumbe. ";

/* Messaging unavailable alert title */
"ErrorMessages.messagingUnavailableTitle" = "Huduma ya ujumbe haipatikani kwa sasa";

/* You can customize your Face ID Spending Limit from the [FaceIdSettings.linkText gets added here as a button] */
"FaceIDSettings.customizeText" = "Unaweza badilisha usajili wa uso (Face ID) kuambatana na kikomo cha matumizi kutoka %1$@";

/* Face Id screen label */
"FaceIDSettings.label" = "Tumia uso wako kufungua DigiWallet na kutuma bitradio kuambatana na kikomo cha matumizi.";

/* Link Text (see FaceIdSettings.customizeText) */
"FaceIDSettings.linkText" = "Unganisha maandishi  (Ona TouchIdSettings.customizeText)";

/* Face id switch label. */
"FaceIDSettings.switchLabel" = "Wezesha usajili wa uso (Face ID) na DigiWallet";

/* Face ID settings view title */
"FaceIDSettings.title" = "Usajili wa uso";

/* Face ID unavailable alert message */
"FaceIDSettings.unavailableAlertMessage" = "Hujawezesha Usajili wa uso (Face ID)  kwa kifaa hichi. Enda kwa mipangilio -> Usajili wa uso & msimbo wa kificho kuwezesha mpangilio huu.";

/* Face ID unavailable alert title */
"FaceIDSettings.unavailableAlertTitle" = "Usajili wa uso haujaanzishwa";

/* Face Id spending limit screen title */
"FaceIDSpendingLimit.title" = "Usajili wa uso kwa kipimo cha matumizi";

/* Economy fee */
"FeeSelector.economy" = "Bei Nafuu";

/* Fee Selector economly fee description */
"FeeSelector.economyLabel" = "Makadirio ya Kuwaslisha : dakika 10+";

/* Warning message for economy fee */
"FeeSelector.economyWarning" = "Chaguo hili halipendekezi kwa shughuli za muda.";

/* Regular fee */
"FeeSelector.regular" = "Kawaida";

/* Fee Selector regular fee description */
"FeeSelector.regularLabel" = "Makadirio ya Kuwaslisha : Sekunde 15-30";

/* Fee Selector title */
"FeeSelector.title" = "Mwendo wa Usindikaji";

/* Checking private key balance progress view text */
"Import.checking" = "Kuangalia masalio ya ufunguo wa kibinafsi ";

/* Sweep private key confirmation message */
"Import.confirm" = "Tuma %1$@ kutoka huu ufunguo wa kibinafsi na kuweka kwa kipochi? Mtandao wa bitradio utapokea ada ya %2$@ ";

/* Duplicate key error message */
"Import.Error.duplicate" = "Ufunguo huu wa kibnafsi tayari unapatikana kwa kipochi chako.";

/* empty private key error message */
"Import.Error.empty" = "Ufunguo huu wa kibinafsi ni mtupu. ";

/* High fees error message */
"Import.Error.highFees" = "Ada ya malipo yana gharama zaidi kuliko fedha zinazopatikana kwenye ufunguo huu binafsi.";

/* Not a valid private key error message */
"Import.Error.notValid" = "Sio ufunguo wa kibinafsi halali\n";

/* Import signing error message */
"Import.Error.signing" = "Hitilafu ya kusaini shughuli\n";

/* Import button label */
"Import.importButton" = "Ingiza";

/* Importing wallet progress view label */
"Import.importing" = "Ingiza kutoka kipochi";

/* Caption for graphics */
"Import.leftCaption" = "Kipochi kinachoingizwa";

/* Import wallet intro screen message */
"Import.message" = "Kuagiza mkoba huhamisha bitradio zote kutoka kipochi chako hadi kwa DigiWallet kwa shughuli moja tu.  ";

/* Enter password alert view title */
"Import.password" = "Funguo hili la kibinafsi limelindwa na nenosiri";

/* password textfield placeholder */
"Import.passwordPlaceholder" = "nenosiri";

/* Caption for graphics */
"Import.rightCaption" = "DigiWallet yako";

/* Scan Private key button label */
"Import.scan" = "Soma kifunguo cha binafsi ";

/* Import wallet success alert title */
"Import.success" = "Umefanikiwa";

/* Successfully imported wallet message body */
"Import.SuccessBody" = "Umefanikiwa kuagiza kipochi";

/* Import Wallet screen title */
"Import.title" = "Ingiza Kipochi";

/* Unlocking Private key activity view message. */
"Import.unlockingActivity" = "Fungua funguo";

/* Import wallet intro warning message */
"Import.warning" = "Kuagiza kipochi haijumuishi historia ya shughuli au maelezo mengine\n ";

/* Wrong password alert message */
"Import.wrongPassword" = "Nenosiri isio sawa, tafadhali jaribu tena. ";

/* Close app button */
"JailbreakWarnings.close" = "Funga";

/* Ignore jailbreak warning button */
"JailbreakWarnings.ignore" = "Puuza";

/* Jailbreak warning message */
"JailbreakWarnings.messageWithBalance" = "USALAMA WA KIFAA UMEVUNJWA \nProgramu yeyote ya 'jailbreak' inaweza kufikia data muhimu ya DigiWallet na kuiba bitradio yako! Futa kipochi hichi mara moja na urejesha kwenye kifaa salama.";

/* Jailbreak warning message */
"JailbreakWarnings.messageWithoutBalance" = "USALAMA WA KIFAA UMEVUNJWA \nProgramu yeyote ya 'jailbreak' inaweza kufikia data muhimu ya DigiWallet na kuiba bitradio yako! Tafadhali tumia DigiWallet kwa kifaa kilicho non-jailbroken. ";

/* Jailbreak warning title */
"JailbreakWarnings.title" = "ONYO";

/* Location services disabled error */
"LocationPlugin.disabled" = "Huduma za eneo zimezimwa.";

/* No permissions for location services */
"LocationPlugin.notAuthorized" = "DigiWallet haina uwezo wa kufikia huduma za eneo.";

/* Wallet creation date prefix */
"ManageWallet.creationDatePrefix" = "Umetengeneza kipochi kwa %1$@";

/* Manage wallet description text */
"ManageWallet.description" = "Jina la kipochi chako linapatikana kwa shughuli za akaunti yako tu na haziwezi onekana na mtu yeyote ule. ";

/* Change Wallet name textfield label */
"ManageWallet.textFeildLabel" = "Jina la kipochi";

/* Manage wallet modal title */
"ManageWallet.title" = "Simamia kipochi";

/* Menu button title */
"MenuButton.lock" = "Funga Kipochi";

/* Menu button title */
"MenuButton.security" = "Kituo Cha Usalama";

/* Menu button title */
"MenuButton.settings" = "Mipangilio";

/* Menu button title */
"MenuButton.support" = "Usaidizi";

/* button label */
"MenuViewController.createButton" = "Unda Kipochi mpya";

/* Menu modal title */
"MenuViewController.modalTitle" = "Orodha";

/* button label */
"MenuViewController.recoverButton" = "Rejesha tena kipochi";

/* Switch to automatic mode button label */
"NodeSelector.automaticButton" = "Badilisha kwa Mode ya kujiendesha";

/* Node is connected label */
"NodeSelector.connected" = "Imeunganishwa";

/* Enter node ip address view body */
"NodeSelector.enterBody" = "Ingiza anwani ya IP ya Node na port (hiari)";

/* Enter Node ip address view title */
"NodeSelector.enterTitle" = "Ingiza Node";

/* Switch to manual mode button label */
"NodeSelector.manualButton" = "Badilisha kwa Mode ya mwongozo";

/* Node address label */
"NodeSelector.nodeLabel" = "Node ya sasa ya msingi";

/* Node is not connected label */
"NodeSelector.notConnected" = "Haijaunganishwa";

/* Node status label */
"NodeSelector.statusLabel" = "Hali ya Kuunganisha ya Node";

/* Node Selector view title */
"NodeSelector.title" = "Nodes za bitradio";

/* Bad Payment request alert title */
"PaymentProtocol.Errors.badPaymentRequest" = "Ombi la Malipo bovu";

/* Error opening payment protocol file message */
"PaymentProtocol.Errors.corruptedDocument" = "Hati isiyotambuliwa au iliyoharibika";

/* Missing certificate payment protocol error message */
"PaymentProtocol.Errors.missingCertificate" = "cheti kukosa";

/* Request expired payment protocol error message */
"PaymentProtocol.Errors.requestExpired" = "ombi lililoisha";

/* Payment too small alert title */
"PaymentProtocol.Errors.smallOutputError" = "Haikuweza kulipa";

/* Amount too small error message */
"PaymentProtocol.Errors.smallPayment" = "Malipo ya bitradio hayawezi kuwa chini ya %1$@";

/* Output too small error message. */
"PaymentProtocol.Errors.smallTransaction" = "Utoaji wa shughuli za bitradio haziwezi kuwa chini ya $@.";

/* Unsupported signature type payment protocol error message */
"PaymentProtocol.Errors.unsupportedSignatureType" = "aina ya saini isiyotambuliwa";

/* Untrusted certificate payment protocol error message */
"PaymentProtocol.Errors.untrustedCertificate" = "cheti lisiloaminiwa ";

/* Enable face ID prompt body */
"Prompts.FaceId.body" = "Bonyeza hapa kuwezesha usajili wa uso";

/* Enable face ID prompt title */
"Prompts.FaceId.title" = "Wezesha usajili wa uso";

/* No passcode set warning body */
"Prompts.NoPasscode.body" = "Msimbo wa kifaa unahitajika ili kulinda kipochi chako. Nenda kwenye mipangilio na uwezeshe nenosiri.";

/* No Passcode set warning title */
"Prompts.NoPasscode.title" = "Wezesha msimbo wa kifaa";

/* Warning about paper key. */
"Prompts.PaperKey.body" = "Funguo lako la kuokoa mkoba lazima uhifadhiwe ikiwa utapoteza au kubadilisha simu yako. Bonyeza hapa kuendelea. ";

/* An action is required (You must do this action). */
"Prompts.PaperKey.title" = "Hatua Inahitajika";

/* Transaction rejected prompt body */
"Prompts.RecommendRescan.body" = "Kipochi chako huenda usiwe na usawazishaji. Hii inaweza kutengenezwa kwa kukagua blockchain tena.";

/* Transaction rejected prompt title */
"Prompts.RecommendRescan.title" = "Shughuli imekataliwa";

/* header of PinView */
"Prompts.SecurityCheck.header" = "SECURITY\nCHECK";

/* Share data prompt body */
"Prompts.ShareData.body" = "Tusaidie kuboresha DigiWallet kwa kututumia data yako isiyojulikana";

/* Share data prompt title */
"Prompts.ShareData.title" = "Eneza data isiyojulikana";

/* Enable touch ID prompt body */
"Prompts.TouchId.body" = "Bonyeza hapa kuwezesha Usajili wa uso";

/* Enable touch ID prompt title */
"Prompts.TouchId.title" = "Wezesha usajili wa uso";

/* Upgrade PIN prompt body. */
"Prompts.UpgradePin.body" = "DigiWallet imeboreshwa kwa kutumia PINI ya nambari 6. Boneza hapa ili kuboresha.\n";

/* Upgrade PIN prompt title. */
"Prompts.UpgradePin.title" = "Wezesha PINI";

/* Notifications will be added later but users can set their preferences now, which is why we specify "in the future". */
"PushNotifications.body" = "Wezesha kupokea ujumbe maalum kutoka kwa DigiWallet hapo siku za usoni.";

/* Push notifications toggle switch label */
"PushNotifications.label" = "Eneza Taarifa";

/* Push notifications are off label */
"PushNotifications.off" = "Zima";

/* Push notifications are on label */
"PushNotifications.on" = "Washa";

/* Push notifications settings view title label */
"PushNotifications.title" = "Taarifa";

/* Address copied message. */
"Receive.copied" = "Ilikopishwa kwenye clipboard.";

/* Share via email button label */
"Receive.emailButton" = "Barua pepe";

/* Request button label */
"Receive.request" = "Omba Kiasi";

/* Share button label */
"Receive.share" = "Shiriki";

/* Share via text message (SMS) */
"Receive.textButton" = "Ujumbe wa maandishi\n";

/* Receive modal title */
"Receive.title" = "Pokea";

/* Done button text */
"RecoverWallet.done" = "Maliza";

/* Recover wallet header */
"RecoverWallet.header" = "Rudisha Kipochi";

/* Reset PIN with paper key: header */
"RecoverWallet.header_reset_pin" = "Weka Upya PINI";

/* Enter paper key instruction */
"RecoverWallet.instruction" = "Ingiza funguo binafsi la kuokoa kipochi";

/* Recover wallet intro */
"RecoverWallet.intro" = "Okoa DigiWallet na funguo binafsi la kuokoa kipochi";

/* Invalid paper key message */
"RecoverWallet.invalid" = "Funguo binafsi la kuokoa kipochi chako ni batili. Tafadhali angalia kila neno  na ujaribu tena.";

/* Previous button accessibility label */
"RecoverWallet.leftArrow" = "Mshale wa kushoto";

/* Next button label */
"RecoverWallet.next" = "Ifuatayo";

/* Reset PIN with paper key: more information button. */
"RecoverWallet.reset_pin_more_info" = "Bonyeza hapa kupata habari zaidi";

/* Next button accessibility label */
"RecoverWallet.rightArrow" = "Mshale wa kulia";

/* Recover wallet sub-header */
"RecoverWallet.subheader" = "Ingiza funguo binafsi la kuokoa DigiWallet unaotaka kuokoa";

/* Reset PIN with paper key: sub-header */
"RecoverWallet.subheader_reset_pin" = "Kuweka upya PINI yako, ingiza maneno kutoka kwenye funguo binafsi ya Kuokoa kipochi chako ndani ya masanduku yaliyo hapa chini.";

/* No amount entered error message. */
"RequestAnAmount.noAmount" = "Tafadhali weka kiasi kwanza.";

/* Request a specific amount of bitcoin */
"RequestAnAmount.title" = "Omba Kiasi";

/* Alert action button label */
"ReScan.alertAction" = "Sawazisha";

/* Alert message body */
"ReScan.alertMessage" = "Hutaweza kutuma bitradio huku usawazisha.";

/* Alert message title */
"ReScan.alertTitle" = "Sawazisha na Blockchain?";

/* extimated time */
"ReScan.body1" = "Dakika 20-45";

/* Syncing explanation */
"ReScan.body2" = "Ikiwa shughuli inaonyesha kama imekamilika kwenye mtandao wa bitradio lakini sio kwenye DigiWallet yako.";

/* Syncing explanation */
"ReScan.body3" = "Unaendelea kupata hitilafu kuwa shughuli uliyojaribu haikubaliwi. ";

/* Start Sync button label */
"ReScan.buttonTitle" = "Anza kusawazisha";

/* Sync blockchain view footer */
"ReScan.footer" = "Hutaweza kutuma bitradio huku usawazisha na blockchain.";

/* Sync Blockchain view header */
"ReScan.header" = "Sawazisha Blockchain";

/* Subheader label */
"ReScan.subheader1" = "Makadirio ya muda";

/* Subheader label */
"ReScan.subheader2" = "Kusawazisha lini?";

/* Scan bitcoin address camera flash toggle */
"Scanner.flashButtonLabel" = "Mwangaza wa Kamera";

/* Complete filter label */
"Search.complete" = "kamili";

/* Pending filter label */
"Search.pending" = "bado kamili";

/* Received filter label */
"Search.received" = "imepokewa";

/* Sent filter label */
"Search.sent" = "imetumwa ";

/* Face ID button title */
"SecurityCenter.faceIdTitle" = "Usajili wa uso";

/* Security Center Info */
"SecurityCenter.info" = "Wezesha vipengele vyote vya usalama kwa ulinzi wa hali ya juu.";

/* Paper Key button description */
"SecurityCenter.paperKeyDescription" = "Njia pekee ya kufikia bitradio yako ikiwa umepoteza au kuboresha simu yako.";

/* Paper Key button title */
"SecurityCenter.paperKeyTitle" = "Funguo binafsi ya kuokoa kipochi";

/* PIN button description */
"SecurityCenter.pinDescription" = "Inalinda DigiWallet yako kutoka kwa watumiaji wasioidhinishwa.";

/* PIN button title */
"SecurityCenter.pinTitle" = "PINI ya tarakimu 6";

/* Security Center Title */
"SecurityCenter.title" = "Kituo cha Usalama";

/* Touch ID button description */
"SecurityCenter.touchIdDescription" = "Fungua kwa urahisi DigiWallet yako na tuma bitradio hadi kikomo ulicho weka.";

/* Touch ID button title */
"SecurityCenter.touchIdTitle" = "Kitambulisho cha kubonyeza";

/* Send money amount label */
"Send.amountLabel" = "Kiasi";

/* Balance: $4.00 */
"Send.balance" = "Salio: %1$@";

/* Camera not allowed message */
"Send.cameraunavailableMessage" = "Nenda kwenye Mipangilio ili kuruhusu upatikanaji wa kamera.";

/* Camera not allowed alert title */
"Send.cameraUnavailableTitle" = "DigiWallet hairuhusiwi kufikia kamera";

/* Warning when sending to self. */
"Send.containsAddress" = "Hifadhi ni anwani yako mwenyewe. Huwezi kujitumia wewe mwenyewe.";

/* Could not create transaction alert title */
"Send.creatTransactionError" = "Haikuweza kuunda shughuli.";

/* Description for sending money label */
"Send.descriptionLabel" = "Taarifa";

/* Emtpy pasteboard error message */
"Send.emptyPasteboard" = "Ubao wa nakala ni mtupu";

/* Network Fee: $0.01 */
"Send.fee" = "Ada ya Mtandao: %1$@";

/* Payee identity not certified alert title. */
"Send.identityNotCertified" = "Kitambulisho cha nayelipa hakijathibitishwa";

/* Invalid address alert message */
"Send.invalidAddressMessage" = "Anwani ya kumalizia sio anwani sahihi ya bitradio.";

/* Invalid address on pasteboard message */
"Send.invalidAddressOnPasteboard" = "Ubao wa kuweka haina anwani ya bitradio halali.";

/* Invalid address alert title */
"Send.invalidAddressTitle" = "Anwani isiyo sahihi";

/* Is rescanning error message */
"Send.isRescanning" = "Kutuma kunazima wakati wa kuchunguza tena kamili.";

/* Loading request activity view message */
"Send.loadingRequest" = "Ombi linapakiwa";

/* Empty address alert message */
"Send.noAddress" = "Tafadhali ingiza anwani ya mpokeaji.";

/* Emtpy amount alert message */
"Send.noAmount" = "Tafadhali ingiza kiasi cha kutuma.";

/* Paste button label */
"Send.pasteLabel" = "Weka";

/* Could not publish transaction alert title */
"Send.publishTransactionError" = "Haikuweza kuchapisha shughuli.";

/* Could not load remote request error message */
"Send.remoteRequestError" = "Haikuweza kupakia ombi la malipo";

/* Scan button label */
"Send.scanLabel" = "Chunguza";

/* Send button label (the action, "press here to send") */
"Send.sendLabel" = "Tuma";

/* Send screen title (as in "this is the screen for sending money") */
"Send.title" = "Tuma";

/* Send money to label */
"Send.toLabel" = "Kwa";

/* Adress already used alert message - first part */
"Send.UsedAddress.firstLine" = "Anwani za bitradio zinalenga kwa matumizi moja tu.";

/* Adress already used alert message - second part */
"Send.UsedAddress.secondLIne" = "Matumizi tena hupunguza faragha kwa wewe na mpokeaji na inaweza kusababisha hasara ikiwa mpokeaji hawezi kudhibiti anwani. ";

/* Adress already used alert title */
"Send.UsedAddress.title" = "Anwani Tayari Imetumika";

/* About label */
"Settings.about" = "Kuhusu";

/* Advanced Settings title */
"Settings.advancedTitle" = "Mipangilio ya juu";

/* i.e. the currency which will be displayed */
"Settings.currency" = "Onyesha Fedha";

/* Join Early access label */
"Settings.earlyAccess" = "Jiunge na kikundi cha kwanza";

/* Are you enjoying bread alert message body */
"Settings.enjoying" = "Je, unafurahia kutumia DigiWallet?";

/* Face ID spending limit label */
"Settings.faceIdLimit" = "Usajili wa uso kutumia kiwango gani";

/* Import wallet label */
"Settings.importTitle" = "Ingiza Kipochi";

/* Manage settings section header */
"Settings.manage" = "Simamia";

/* Notifications label */
"Settings.notifications" = "Taarifa";

/* Leave review button label */
"Settings.review" = "Tuachie Mapitio";

/* Share anonymous data label */
"Settings.shareData" = "Shiriki data isiyojulikana";

/* Sync blockchain label */
"Settings.sync" = "Sawazisha Blockchain";

/* Settings title */
"Settings.title" = "Mipangilio";

/* Touch ID spending limit label */
"Settings.touchIdLimit" = "Kitambulisho cha kubonyeza kipimo cha kutumia";

/* Wallet Settings section header */
"Settings.wallet" = "Kipochi";

/* Start or recover another wallet menu label. */
"Settings.wipe" = "Anza / Pata Kipochi Kingingine";

/* Share data view body */
"ShareData.body" = "Saidia kuboresha DigiWallet kwa kutuma data yako isiyojulikana. Hii haijumuishi maelezo yoyote ya kifedha. Tunaheshimu siri yako ya kifedha.";

/* Share data header */
"ShareData.header" = "Shiriki data?";

/* Share data switch label. */
"ShareData.toggleLabel" = "Shiriki data isiyojulikana? ";

/* button label */
"StartPaperPhrase.againButtonTitle" = "Andika tena funguo binafsi ya kuokoa kipochi tena ";

/* Paper key explanation text. */
"StartPaperPhrase.body" = "Funguo binafsi ya kuokoa kipochi chako ni njia pekee ya kurejesha DigiWallet yako ikiwa simu yako imepotea, imeibiwa, imevunjwa, au imeboreshwa.\n\nTutakuonyesha orodha ya maneno ya kuandika kwenye karatasi na ili uhifadhi.";

/* button label */
"StartPaperPhrase.buttonTitle" = "Andika chini funguo binafsi la kuokoa kipochi ";

/* Argument is date */
"StartPaperPhrase.date" = "Siku ya mwisho kuandika chini funguo binafsi la kuokoa kipochi ni %1$@";

/* Start view message */
"StartViewController.message" = "Njia salama zaidi ya kutumia bitradio.";

/* labels of syncView */
"SynchingView.blockHeightLabel" = "BLOCK HEIGHT";

"SynchingView.progressLabel" = "PROGRESS";

/* Syncing view connectiong state header text */
"SyncingView.connecting" = "Kuunganisha";

/* Syncing view header text */
"SyncingView.header" = "Inalinganisha";

/* Retry button label */
"SyncingView.retry" = "Jaribu tena";

/* Syncing view syncing state header text */
"SyncingView.syncing" = "Inalinganisha";

/* 6 d (6 days) */
"TimeSince.days" = "%1$@ s";

/* 6 h (6 hours) */
"TimeSince.hours" = "%1$@ m";

/* 6 m (6 minutes) */
"TimeSince.minutes" = "%1$@ m";

/* 6 s (6 seconds) */
"TimeSince.seconds" = "%1$@ s";

/* You can customize your Touch ID Spending Limit from the [TouchIdSettings.linkText gets added here as a button] */
"TouchIdSettings.customizeText" = "Unaweza badilisha kikomo chako cha matumizi ya Kitambulisho cha kubonyeza";

/* Touch Id screen label */
"TouchIdSettings.label" = "Tumia vidole vyako kufungua DigiWallet na kutuma bitradio kwa kikomo ulicho kuweka.";

/* Link Text (see TouchIdSettings.customizeText) */
"TouchIdSettings.linkText" = "Kitambulisho cha kubonyeza skrini ya kipimo cha kutumia";

/* Spending Limit: b100,000 ($100) */
"TouchIdSettings.spendingLimit" = "Kikomo cha matumizi: %1$@ (%2$@)";

/* Touch id switch label. */
"TouchIdSettings.switchLabel" = "Wezesha kujitambulisha kwa kubonyeza kwa DigiWallet";

/* Touch ID settings view title */
"TouchIdSettings.title" = "Kujitambulisha cha kubonyeza";

/* Touch ID unavailable alert message */
"TouchIdSettings.unavailableAlertMessage" = "Huwezesha kujitambulisha kwa kubonyeza kwenye kifaa hiki. Nenda kwenye Mipangilio-> Kitambulisho cha kubonyeza na Msimbo wa Nambari ili kuitenegeneza sasa.";

/* Touch ID unavailable alert title */
"TouchIdSettings.unavailableAlertTitle" = "Kitambulisho cha kubonyeza hakijawekewa";

/* Always require passcode option */
"TouchIdSpendingLimit" = "Daima unahitaji nenosiri";

/* Touch ID spending limit screen body */
"TouchIdSpendingLimit.body" = "Utaulizwa kuingiza PINI yako ya tarakimu 6 kutuma shughuli yoyote juu ya kiwango chako cha matumizi, na kila masaa 48 tangu mwisho wa kuingiza PINI yako ya tarakimu 6.";

/* Touch Id spending limit screen title */
"TouchIdSpendingLimit.title" = "Kitambulisho cha kubonyeza kipimo cha kutumia";

/* Availability status text */
"Transaction.available" = "Inapatikana kwa Kutumia";

/* Transaction complete label */
"Transaction.complete" = "Kamili";

/* eg. Ending balance: $50.00 */
"Transaction.ending" = "Salio la Mwisho: %1$@";

/* Exchange rate on date header */
"Transaction.exchangeOnDayReceived" = "Kima cha kubadilisha ilipopokewa: ";

/* Exchange rate on date header */
"Transaction.exchangeOnDaySent" = "Kima cha kubadilisha wakati wa kutuma: ";

/* (b600 fee) */
"Transaction.fee" = "(%1$@ ada)";

/* Invalid transaction */
"Transaction.invalid" = "BATILI";

/* Timestamp label for event that just happened */
"Transaction.justNow" = "sasa hivi";

/* Receive status text: 'In progress: 20%' */
"Transaction.receivedStatus" = "Inaendelea: %1$@";

/* Send status text: 'In progress: 20%' */
"Transaction.sendingStatus" = "Inaendelea %1$@";

/* eg. Starting balance: $50.00 */
"Transaction.starting" = "Salio la Mwanzo: %1$@";

/* Waiting to be confirmed string */
"Transaction.waiting" = "Inasubiri kuthibitishwa. Wafanyabiashara wengine wanahitaji uthibitisho wa kukamilisha shughuli. Makadirio wa Muda: dakika 1-2.";

/* e.g. I received money from an account. */
"TransactionDetails.account" = "akaunti";

/* Amount section header */
"TransactionDetails.amountHeader" = "Kiasi ";

/* Block height label */
"TransactionDetails.blockHeightLabel" = "Imethibitishwa katika Block";

/* Memo section header */
"TransactionDetails.commentsHeader" = "Taarifa";

/* Empty transaction list message. */
"TransactionDetails.emptyMessage" = "Shughuli zako zitaonekana hapa.";

/* "Received [$5] at [which of my addresses]" => This is the "at [which of my addresses]" part. */
"TransactionDetails.from" = "kwa %1$@";

/* More button title */
"TransactionDetails.more" = "Zaidi...";

/* Moved $5.00 (as in "I moved $5 to another location") */
"TransactionDetails.moved" = "Ilihamishwa %1$@";

/* Moved $5.00 */
"TransactionDetails.movedAmountDescription" = "Ilihamishwa <b>%1@</b>";

/* eg. Confirmed in Block: Not Confirmed */
"TransactionDetails.notConfirmedBlockHeightLabel" = "Haijahakikishiwa";

/* "Received [$5] at [which of my addresses]" => This is the "Received [$5]" part. */
"TransactionDetails.received" = "Imepokewa %1$@";

/* Received $5.00 */
"TransactionDetails.receivedAmountDescription" = "Imepokewa <b>%1@</b>";

/* "Sent [$5] to [address]" => This is the "Sent [$5]" part. */
"TransactionDetails.sent" = "Ilitumwa %1$@";

/* Sent $5.00 */
"TransactionDetails.sentAmountDescription" = "Ilitumwa <b>%1@</b>";

/* Status section header */
"TransactionDetails.statusHeader" = "Hali";

/* Transaction Details Title */
"TransactionDetails.title" = "Maelezo ya Shughuli";

/* "Sent [$5] to [address]" => This is the "to [address]" part. */
"TransactionDetails.to" = "Kwa %1$@";

/* Transaction ID header */
"TransactionDetails.txHashHeader" = "bitradio Kitambulisho cha Shughuli";

/* (this transaction was) Received at this address: */
"TransactionDirection.address" = "Imepokewa kwenye Anwani hii";

/* (this transaction was) Sent to this address: */
"TransactionDirection.to" = "Imetumwa kwenye Anwani hii";

/* filter buttons for transactionView */
"TransactionView.all" = "all";

"TransactionView.received" = "received";

"TransactionView.sent" = "sent";

/* Disabled until date */
"UnlockScreen.disabled" = "Imezuiliwa mpaka: %1$@";

/* My Address button title */
"UnlockScreen.myAddress" = "Anwani yangu";

/* Reset PIN with Paper Key button label. */
"UnlockScreen.resetPin" = "Rekebisha PINI";

/* Scan button title */
"UnlockScreen.scan" = "Chunguza";

/* Unlock Screen sub-header */
"UnlockScreen.subheader" = "Ingiza PINI";

/* TouchID prompt text */
"UnlockScreen.touchIdPrompt" = "Kufungua DigiWallet yako.";

/* Unlock with TouchID accessibility label */
"UnlockScreen.touchIdText" = "Fungua na kitambulisho cha kubonyeza ";

/* Wallet unlocked message */
"UnlockScreen.unlocked" = "Kipochi Kimefunguliwa";

/* Update PIN caption text */
"UpdatePin.caption" = "Kumbuka hii PINI. Ukiisahau, huwezi kufikia bitradio yako/zako.";

/* PIN creation info. */
"UpdatePin.createInstruction" = "PINI yako itatumika kufungua DigiWallet yako na kutuma bitradio.";

/* Update PIN title */
"UpdatePin.createTitle" = "Weka PINI";

/* Update PIN title */
"UpdatePin.createTitleConfirm" = "Weka PINI tena";

/* Enter current PIN instruction */
"UpdatePin.enterCurrent" = "Ingiza PINI yako ya sasa";

/* Enter new PIN instruction */
"UpdatePin.enterNew" = "Ingiza PINI yako mpya";

/* Re-Enter new PIN instruction */
"UpdatePin.reEnterNew" = "Ingiza PINI yako mpya tena";

/* Update PIN failure error message. */
"UpdatePin.setPinError" = "Samahani, haiwezi kusasisha PINI.";

/* Update PIN failure alert view title */
"UpdatePin.setPinErrorTitle" = "Hitilafu ya kusasisha pini";

/* Update PIN title */
"UpdatePin.updateTitle" = "Sasisha PINI";

/* Authorize to copy wallet addresses alert message */
"URLHandling.addressaddressListAlertMessage" = "Nakili anwani ya kipochi kwenye clipboard?";

/* Authorize to copy wallet address PIN view prompt. */
"URLHandling.addressList" = "Thibitisha kupakia anwani ya kipochi kwenye clipboard";

/* Authorize to copy wallet address alert title */
"URLHandling.addressListAlertTitle" = "Nakala Anwani za kipochi";

/* Copy wallet addresses alert button label */
"URLHandling.copy" = "Nakili";

/* Verify PIN for transaction view body */
"VerifyPin.authorize" = "Tafadhali ingiza PINI yako ili uidhinishe shughuli hii.";

/* Verify PIN view body */
"VerifyPin.continueBody" = "Tafadhali ingiza PINI yako ili kuendelea.";

/* Verify PIN view title */
"VerifyPin.title" = "PINI inahitajika";

/* Authorize transaction with touch id message */
"VerifyPin.touchIdMessage" = "Thibitisha shughuli hii";

/* 'No wallet' warning for watch app */
"Watch.noWalletWarning" = "Fungua DigiWallet kwa simu ya iPhone kuanzisha kipochi chako wako.";

/* Dismiss button label */
"Webview.dismiss" = "Futa";

/* Webview loading error message */
"Webview.errorMessage" = "Kulikuwa na hilitafu ya kuweka maudhui. Tafadhali jaribu tena.";

/* Updating webview message */
"Webview.updating" = "Inasasisha ...";

/* Welcome screen text. (?) will be replaced with the help icon users should look for. */
"Welcome.body" = "bitradio kwa iOS imebadilisha jina lake kwa DigiWallet, na nakshi mpya.\n\nIkiwa unahitaji msaada, angalia (?) Sehemu ya juu ya skrini.";

/* Top title of welcome screen */
"Welcome.title" = "Karibu kwenye DigiWallet!";

/* Wipe wallet alert message */
"WipeWallet.alertMessage" = "Una uhakika unataka kufuta kipochi hichi?";

/* Wipe wallet alert title */
"WipeWallet.alertTitle" = "Futa Kipochi?";

/* Failed wipe wallet alert message */
"WipeWallet.failedMessage" = "Imeshindwa kuifuta Kipochi.";

/* Failed wipe wallet alert title */
"WipeWallet.failedTitle" = "Imeshindwa";

/* Enter phrase to wipe wallet instruction. */
"WipeWallet.instruction" = "Ingiza ufunguo binafsi wa kuokoa kipochi ili kuifuta na kuanza au kurejesha mwingine. Salio yako kwa sasa itabakia kwenye ufunguo binafsi wa kuokoa kipochi.";

/* Start wipe wallet view message */
"WipeWallet.startMessage" = "Kuanza au kurejesha kipochi chingine utapata kufikia na kusimamia DigiWallet tofauti kwenye kifaa hiki.";

/* Start wipe wallet view warning */
"WipeWallet.startWarning" = "Hutaweza tena kufikia DigiWallet yako kutoka kwenye kifaa hiki. Salio litatabaki kwenye ufunguo binafsi wako wa kipochi.";

/* Wipe wallet navigation item title. */
"WipeWallet.title" = "Anza au Okoa Kipochi kingine ";

/* Wipe wallet button title */
"WipeWallet.wipe" = "Futa";

/* Wiping activity message */
"WipeWallet.wiping" = "Futa...";

/* Paper key instructions. */
"WritePaperPhrase.instruction" = "Andika kila neno kwa utaratibu na uihifadhi mahali salama.";

/* button label */
"WritePaperPhrase.next" = "Ifuatayo";

/* button label */
"WritePaperPhrase.previous" = "Awali";

/* 1 of 3 */
"WritePaperPhrase.step" = "%1$d ya %2$d";

